Description: 'Downloads latest Docker Desktop app and uploads to Fleet'
Identifier: com.github.kitzy.fleet.DockerDesktop
Input:
  NAME: Docker Desktop
MinimumVersion: '2.0'
ParentRecipe: com.github.homebysix.pkg.DockerDesktop
Process:
- Arguments:
    # Core package info (from parent recipe)
    pkg_path: '%pkg_path%'
    software_title: '%NAME%'
    version: '%version%'
    
    # Fleet API configuration (required)
    fleet_api_base: '%FLEET_API_BASE%'
    fleet_api_token: '%FLEET_API_TOKEN%'
    team_id: '%FLEET_TEAM_ID%'
    
    # Git/GitHub configuration (required)
    git_repo_url: '%FLEET_GITOPS_REPO_URL%'
    github_token: '%FLEET_GITOPS_GITHUB_TOKEN%'
    team_yaml_path: '%FLEET_TEAM_YAML_PATH%'
  Processor: com.github.kitzy.FleetGitOpsUploader/FleetGitOpsUploader