Description: "Builds Google Chrome.pkg using the upstream recipe, then uploads to Fleet and opens a GitOps PR."
Identifier: com.github.kitzy.fleet.GoogleChrome
Input:
  NAME: Google Chrome
MinimumVersion: "2.0"
ParentRecipe: com.github.autopkg.pkg.googlechrome
Process:
- Arguments:
    # Core package info (from parent recipe)
    pkg_path: "%pkg_path%"
    software_title: "%NAME%"
    version: "%version%"
    
    # Fleet API configuration (required)
    fleet_api_base: "%FLEET_API_BASE%"
    fleet_api_token: "%FLEET_API_TOKEN%"
    team_id: "%FLEET_TEAM_ID%"
    
    # Git/GitHub configuration (required)
    git_repo_url: "%FLEET_GITOPS_REPO_URL%"
    github_token: "%FLEET_GITOPS_GITHUB_TOKEN%"
    team_yaml_path: "%FLEET_TEAM_YAML_PATH%"
  Processor: com.github.kitzy.FleetImporter/FleetImporter